rss/data/highenergylogic.html
<!DOCTYPE html>
<html lang="ru">
<head>
<!-- 2025-12-23 Tue 20:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Логика высоких энергий</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<p>
<span class="underline">В предыдущих сериях</span>: <a href="highenergyphilosophy.html">Философия высоких энергий</a><br>
</p>

<p>
Есть у многих ужасная привычка – пытаться выводить философские или политические мнения логически из первых принципов. Это <a href="factsandlogic.html">никогда не работает</a>, но почему-то в любом споре логическая цепочка от аксиом к выводам считается гипер-убийственным аргументом, и если твой оппонент не может ответить на “покажи, в каком именно месте я ошибся в рассуждении” – то можно присуждать себе победу. Ведь если дать правильные определения словам – списки достаточных и необходимых свойств, которые строго разбивают мир на Х и не-Х, и которые можно применять как предикаты к предметам в реальном мире – и доказать что-то <i>математически</i>, то оно доказано <i>в принципе</i>, верно? В этом же суть математики?<br>
</p>

<p>
В настоящей математике такой подход работает только и исключительно из-за <i>крайне душных</i> требований к математической строгости. 99.99% строгость недостаточна. Если есть хотя бы одно слово во всем аргументе, которое вы не можете полностью выразить символами языка (например) теории множеств Цермело-Френкеля – то это не логический аргумент. Он в лучшем случае <i>логичный</i>. Что тоже очень хорошо! Аргументы должны быть логичными! Но это совсем другая вещь, с которой нужно иначе работать. Если речь идет о логичных, но не строго логических аргументах, то совершенно допустимо быть согласным со всеми предпосылками, согласным со всеми промежуточными шагами, но не согласным с выводами. Совершенно возможно иметь два одинаково логичных аргумента, выводы которых противоречат друг другу. Совершенно возможно опровергнуть логичный аргумент еще более логичным.<br>
</p>

<p>
Если пытаться брать логичные аргументы (или, как оно часто бывает, логикообразные) аргументы и рассматривать их как логические – можно убедить себя в любой ерунде, или даже в нескольких противоречащих друг друг ерундах одновременно. Хуже того, можно стать полностью имунным ко всем попыткам себя переубедить; самоуверенность фатально ошибающихся техбро, залогировавших себя в угол, осмеивалась даже в <i>xkcd</i>.<br>
</p>

<p>
Что как метод познания это не работает, должно быть очевидно хотя бы потому что исторически так приходили к совершенно противоположным выводам. Если ты, читатель, не христианин, то для тебя может быть сходу убедительным тот факт, что такие весьма внушительные люди как Рене Декарт, Готфрид Лейбниц или Святой Ансельм вывели логически из первых принципов существование христианского Бога, и ошибки в их рассуждениях никто не мог найти веками. А если ты, читатель, не монархист, то Томас Хоббс так же вывел необходимость абсолютной монархии. Если ты христианский монархист, то тебе к настоящему психиатру, а не к недоучке с блогом, но всем остальным должно быть понятно, что это не настолько непробиваемая тактика, как может показаться. Логика  не работает <i>сама по себе</i>, она только дает структуру мыслям, следуя закону “мусор на входе – мусор на выходе” <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. Она защищает тебя от некоторых ошибок в рассуждениях, но даже близко не от всех.<br>
</p>

<p>
Это относится не только к спорам в интернете, но и к личной эпистемологии. Надо всегда относиться с подозрением к любой идее в своей голове, которая составлена на основе длинной цепочки соображений. Если вам нужно сорок логических шагов, чтобы дойти от самоочевидных аксиом до итогового мнения, и каждый шаг на 98% справедлив, то вы не будете видеть ошибку ни в одном из них, все они будут чувствоваться верными, и на вопрос “где именно здесь ошибка в рассуждении” ответа не будет. Но вся цепочка будет скорее неверна, чем верна.<br>
</p>

<p>
Я, в целом, советую дикий синкретизм и <a href="https://en.wikipedia.org/wiki/The_Hedgehog_and_the_Fox">лисью эпистемологию</a>, при которых убеждения собираются по кусочкам на основе как можно разнообразного и большого числа соображений, источников и точек зрения, включая, но не ограничиваясь логическими умозаключениями. Но если все же <i>очень хочется</i> вывести что-то чисто логически… или если вы читаете чей-то чужой аргумент, который ограничивается логической цепочкой и считает, будто на этом все и должно закончиться…<br>
</p>

<p>
Иногда нужны способы разбивать такого оппонента. Оппонентом может быть спорщик, или им можете быть вы сами в процессе рефлексии – в любом случае поможет попробовать взять логический аргумент и <i>на самом деле</i> применить на него всю силу математической строгости. И если это покажется вам душной придиркой – что ж, значит аргумент как минимум частично ошибочный, и мы просто торгуемся о величине ошибки. И это хороший способ искать конкретные слабые места – места, где интуиция оппонента дала ложную подсказку, или где он на самом деле не полностью разбирается в ситуации.<br>
</p>

<p>
Давайте я покажу вам несколько веселых логических формул, которыми можно обстреливать логический аргумент для проверки на прочность. Для затравки.<br>
</p>
<div id="outline-container-org258ac86" class="outline-2">
<h2 id="org258ac86">\(((A\implies B) \vdash (A\land C \implies B))\)</h2>
<div class="outline-text-2" id="text-org258ac86">
<p>
Перевод на русский: если из неких предположений следуют некие выводы, то это не перестанет быть правдой от добавления новых предположений.<br>
</p>

<p>
Иными словами, если кто-то утверждает, что из А следует B, то вы можете додумать любые дополнительные <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> факты, какие вам вздумается, даже если в изначальные предположения они не входят. Если B от этого перестает быть правдой – что ж, значит в рассуждениях где-то ошибка.<br>
</p>

<p>
Частным случаем этой формулы является “доведение до абсурда” – что на самом деле полностью кромулентный логический прием, запятнанный ассоциацией с софистическим приемом пропаганды. Но можно и не только доводить до абсурда имеющиеся предположения – можно добавлять совершенно новые, любые.<br>
</p>

<p>
Айн Рэнд очень логично обосновала, почему, если человек смог заработать много денег, то он умный и достойный, а значит сделает со своими деньгами много добра. Окей, а что если после первого миллиона долларов у людей внезапно происходит повреждение мозга, превращающее их в дебилов? Здесь не обязательно утверждать, что это реально может быть – просто это сразу открывает целый пласт возможных возражений по поводу того, насколько люди меняются со временем. Дальше мы уже торгуемся, насколько именно и в каком качестве.<br>
</p>
</div>
</div>
<div id="outline-container-orgac9e2b7" class="outline-2">
<h2 id="orgac9e2b7">\((A\vdash B)\land (A\land B \vdash \bot) \vdash (A \vdash \bot)\) <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></h2>
<div class="outline-text-2" id="text-orgac9e2b7">
<p>
Искать ошибку в рассуждении может быть сложно. Для этого надо проверить все предпосылки и все шаги. Пока вы будете это делать, оппонент уже придумает следующий плохой аргумент. К счастью, если вы сумеете показать, что из этого же рассуждения следует ложь, это с логической точки зрения совершенно то же самое, и обычно намного проще.<br>
</p>

<p>
Аргумент против аборта из книги <i>After Virtue</i> <sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup><br>
</p>

<blockquote>
<p>
I cannot will that my mother should have had an abortion when she was pregnant with me, except perhaps if it had been certain that the embryo was dead or gravely damaged. But if I cannot will this in my own case, how can I consistently deny to others the right to life that I claim for myself? I would break the so-called Golden Rule unless I denied that a mother in general has a right to an abortion.<br>
</p>
</blockquote>

<p>
Опровержение: допустим моя мать изнасиловала моего отца, и это привело к моему зачатию. Получается, было аморально ее остановить? И в целом останавливать изнасилования нельзя, если там есть шанс зачатия ребенка? Бум! Опровергнуто - и для этого совершенно не обязательно распутывать понятия Золотого Правила или обобщений прав или чего угодно другого сложного, что сказал автор.<br>
</p>

<p>
Если оппонент признает, что останавливать изнасилования можно, то мы уже согласились, что лишать других права на жизнь можно, и теперь мы только торгуемся, когда это хорошо, а когда плохо.<br>
</p>
</div>
</div>
<div id="outline-container-org2fe5f26" class="outline-2">
<h2 id="org2fe5f26">\(\overline{(A\land B)} \vdash (\overline{A}\lor \overline{B})\)</h2>
<div class="outline-text-2" id="text-org2fe5f26">
<p>
Также известен как закон де Моргана. По-русски – чтобы отрицать утверждение целиком, достаточно отрицать хотя бы один его компонент; не обязательно отрицать <span class="underline">все</span>.<br>
</p>

<p>
На сервере Солнечной Империи нарушения этого закона замемились как “законы антишариата”. Сценарий платинового треда:<br>
</p>

<ul class="org-ul">
<li>я отрицаю институт частной собственности<br></li>
<li>мне рассказывают, насколько будет плохо не иметь права на собственную зубную щетку<br></li>
<li>я возражаю, что с чего бы то что-то вообще было с твоей зубной щеткой?<br></li>
<li>меня вопрошают, а что помешает ее отобрать, если права собственности ее не защищают<br></li>
</ul>

<p>
Законы шариата запрещают убийство, а я против законов шариата. Значит ли это, что я за убийство? Нет – шариат запрещает много что; чтобы быть против шариата, мне достаточно быть против хотя бы одного запрета, не против всех сразу. Отрицать законы шариата не значит поддерживать законы полной противоположности шариата (“антишариата”). Институт частной собственности делает много что, кроме защиты зубных щеток – так что я могу одновременно утверждать право на зубные щетки и отрицать право на частную собственность.<br>
</p>

<p>
В риторике и рассуждении этот закон нужен, чтобы разбивать черно-белое, бинарное мышление оппонента. Отрицание белого не значит черное. Отсутствие идеального решения не значит отсутствие частичного. Быть против частности не значит отрицать общность. И как только эта ошибка была найдена – дальше мы уже торгуемся, насколько много там серых зон и промежуточных вариантов.<br>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#1057;&#1085;&#1086;&#1089;&#1082;&#1080;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">где “мусором на входе” могут быть не только ложные предпосылки</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">не противоречащие А; технически формула останется верной даже с противоречием, но только как vacuous truth</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">эта формула выглядит страшнее, чем она является по сути, потому что из соображений математической душности нужно соблюдать разницу между “следует из“ и “выводится из“ – она есть!</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">я это взяла из <a href="https://slatestarcodex.com/2013/04/13/proving-too-much/">чужого поста</a>; я не читала книгу</p></div></div>


</div>
</div></div>
</body>
</html>
